#     Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.

#     Пример:
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]

lst = [2, 3, 4, 5, 6]
lst_new = []
mult = 1

if len(lst)%2 == 0:
    leght = int(len(lst)/2)
else:
    leght = int(len(lst)/2 +1)

for i in range(0, leght):
    mult = lst[i] * lst[-i-1]
    lst_new.append(mult)
    
print(f"исходный список {lst}")    
print(f"результирующий список {lst_new}")